/*
 * @Author: Zhou Yi
 * @Date: 2021-08-12 17:33:08
 * @LastEditors: Zhou Yi
 * @LastEditTime: 2021-08-13 14:51:54
 */

export const SEX = {
  1: '男',
  2: '女',
};
export const MARST = {
  1: '未婚',
  2: '已婚',
  3: '离异',
  Z: '其他',
};

export const INDUSTRY = {
  A: '农、林、牧、渔业',
  B: '采矿业',
  C: '制造业',
  D: '电力、燃气及水的生产和供应业',
  E: '建筑业',
  F: '交通运输、仓储和邮政业',
  G: '信息传输、计算机服务和软件业',
  H: '批发和零售业',
  I: '住宿和餐饮业',
  J: '金融业',
  K: '房地产业',
  L: '租赁和商务服务业',
  M: '科学研究、技术服务和地质勘探业',
  N: '水利、环境和公共设施管理业',
  O: '居民服务和其他服务业',
  P: '教育',
  Q: '卫生、社会保障和社会福利业',
  R: '文化、体育、娱乐业',
  S: '公共管理与社会组织',
  T: '国际组织',
  Z: '其他',
};

export const GRADE_METHOD = {
  Z01: '客户等级',
  Z02: '客户洗钱风险等级',
  Z03: '客户风险等级（个人）',
  Z04: '企业信用等级（对公）',
};

export const FACE_SIGNATURE = {
  0: '非柜面面签',
  1: '柜面面签',
};

export const CUST_GRADE = {
  R1: '卓然',
  R2: '悠然',
  R3: '欣然',
  R4: '普通',
  R5: '私银',
};

export const RISK_GRADE = {
  '01': '非常保守型',
  '02': '稳健保守型',
  '03': '中庸型',
  '04': '温和成长型',
  '05': '积极成长型',
};

export const CATEGORY = {
  1: 'VISA卡',
  2: '银联卡',
  3: '定期一本通',
  4: '活期一本通',
  5: '单位卡',
  6: '普通存折',
  8: '电子卡',
  9: '移动支付卡',
  A: '单位结算卡',
  B: '小微企业结算卡',
  C: '新商户卡',
  D: '单位定期一本通',
};
